Yourcomputermaster/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Yourcomputermaster/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Yourcomputermaster/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Yourcomputermaster/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_ПодразделенияСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Yourcomputermaster/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбонентскаяПлата</name>
  </enumValues>
</mdclass:Enum>

Yourcomputermaster/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Yourcomputermaster/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	
	ПроверкаПройдена = ПроверкаДоговораАбонентскойПлаты(Ссылка, Дата);
	
	Если НЕ ПроверкаПройдена Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		ДанныеСсылка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаПроведенияРабот, Сотрудник, ВремяНачалаРаботПлан");
		
		Если ДанныеСсылка.ДатаПроведенияРабот <> ДатаПроведенияРабот Или
			ДанныеСсылка.Сотрудник <> Сотрудник Или
			ДанныеСсылка.ВремяНачалаРаботПлан <> ВремяНачалаРаботПлан Тогда
			Текст = СтрШаблон("Корректировка по заказу № %1!
			|Сотрудник: %2
			|Клиент: %3
			|Дата проведения работ: %4
			|Время (План) %5
			|Проблема : %6",Номер, Сотрудник, Клиент, ДатаПроведенияРабот, Формат(ВремяНачалаРаботПлан, "ДЛФ=T;"), ОписаниеПроблемы);
		КонецЕсли;
	ИначеЕсли ЭтоНовый() Тогда
		Текст = СтрШаблон("Появился новый заказ!
		|Сотрудник: %1
		|Клиент: %2
		|Дата проведения работ: %3
		|Время (План) %4
		|Проблема : %5", Сотрудник, Клиент, ДатаПроведенияРабот, Формат(ВремяНачалаРаботПлан, "ДЛФ=T;"), ОписаниеПроблемы);
	КонецЕсли;
		
	Элемент = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
	Элемент.ТекстСообщения = Текст;
	Элемент.Записать();
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	СтавкаЧаса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"СтавкаЧас" );
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	Процент = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.ПроверкаПроцентаОплатыОтРабот(Сотрудник, МоментВремени().Дата);
	Если Процент = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("У данного сотрудника не установлен пройент от работы!
		|Проведение документа невозможно!");
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ВыполненныеРаботы Цикл
		
		ДвижениеКлиент = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		ДвижениеКлиент.Период = Дата;
		ДвижениеКлиент.Клиент = Клиент;
		ДвижениеКлиент.Договор = Договор;
		ДвижениеКлиент.КоличествоЧасов = Строка.ЧасыКОплатеКлиенту;
		ДвижениеКлиент.СуммаКОплате = СтавкаЧаса * Строка.ЧасыКОплатеКлиенту;
		
		ДвижениеСотрудник = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		ДвижениеСотрудник.Период = Дата;
		ДвижениеСотрудник.ДатаПроведенияРабот = ДатаПроведенияРабот;
		ДвижениеСотрудник.Сотрудник = Сотрудник;
		ДвижениеСотрудник.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
		
		Если Процент = 0 Тогда
			ДвижениеСотрудник.СуммаКОплате = 0;
		Иначе
			ДвижениеСотрудник.СуммаКОплате = Строка.ЧасыКОплатеКлиенту * СтавкаЧаса * Процент / 100;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверкаДоговораАбонентскойПлаты(ДанныеЗаполнения, ДатаДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ДействуетДо
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.АбонентскаяПлата)
	|	И &ДатаДокумента МЕЖДУ ДоговорыКонтрагентов.Дата И ДоговорыКонтрагентов.ДействуетДо";
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
